{
  "en":{
    "title":"Digital Portfolio",
    "subtitle":"This is a small sample of some of the projects I've undertaken in my years as a hobbyist programmer.",
    "case-study":"Case Study:",
    "displays":[
      {
        "title":"Pokémon Interactive Maps",
        "year":2020,
        "ribbons":[
          "HTML5", "CSS3", "JS", "Node.js", "Bootstrap", "SQL", "Vue.js"
        ],
        "contents":[
          {
            "textWidth":"60%",
            "contentWidth":"40%",
            "text":[
              "A simple webapp, small, clean, fast and intuitive, it communicates with a <b>third party, open source database</b> to fetch data which is parsed and presented in a beautifully designed page.",
              "The application is <b>responsive</b>, adapting itself to any screen size, resolution and device, including mobile devices in both landscape and portrait modes, it is also <b>reactive</b>, thanks to the utilization of the <b>Vue JS</b> framework.",
              "The page is designed to be efficient and easy to cache, downloading all the necessary data in a single request on page load therefore allowing its use once loaded even when offline and allows the data to be refreshed without delay at user request.",
              "<a href='/Pokemon/Kanto'>Visit it here.</a>"
            ],
            "hContents":0
          }
        ]
      },
      {
        "title":"NARNES",
        "year":2019,
        "ribbons":[
          "C++", "C#"
        ],
        "contents":[
          {
            "textWidth":"50%",
            "contentWidth":"50%",
            "text":[
              "A fully featured NES emulator with a twist.",
              "It features a <b>C++ core</b> that emulates NES hardware at a low level and a <b>C# forms GUI</b> intercommunicating via <b>Interop middleware</b>, it has every feature that is expected of a modern emulator: sRAM, save stating, demo recording and even rewinding.",
              "More importantly it features the ability to generate and load <b>'asset packs'</b> that allow the <b>replacement of in-game assets</b> with user-defined alternatives, <b>in real time</b> allowing the bypassing of NES hardware restrictions such as resolution, palette and fidelity."
            ],
            "hContents":2
          },
          {
            "textWidth":"40%",
            "contentWidth":"60%",
            "text":[
              "Assisted with a user friendly, drag-and-drop GUI that allows users to create 'asset packs' without the need to understand NES hardware.",
              "These asset packs are then saved as a single <b>.narp</b> file that can be easily shared and used by anyone with NARNES."
            ],
            "hContents":4
          }
        ]
      },
      {
        "title":"NARL",
        "year":2018,
        "ribbons":[
          "C#", "Godot"
        ],
        "contents":[
          {
            "textWidth":"60%",
            "contentWidth":"40%",
            "text":[
              "A minimalistic yet powerful and lightweight gaming frontend.",
              "It communicates with multiple external <b>API</b>s to help the user find a multitude of banners, screenshots and icons to use as a cover for their games, it then provides a separate executable that launches a clean <b>GUI</b> that can be navigated with either keyboard or gaming controllers."
            ],
            "hContents":5
          },
          {
            "textWidth":"60%",
            "contentWidth":"40%",
            "text":[
              "It allows the user to search and launch any game in their PC from a single place, it also provides other convenient features such as keeping track of time spent playing each title.",
              "Published on itch.io on January 1, 2019, it was updated for a year and used by more people than I expected. It is now discontinued.",
              "<a href='https://simplyb.itch.io/narl'>Find it here.</a>"
            ],
            "hContents":6
          }
        ]
      }
    ]
  },
  "es":{
    "title":"Portafolio Digital",
    "subtitle":"Una pequeña muestra de alguno de los proyectos que he desarrollado durante mis años como programador hobbyista.",
    "case-study":"Caso de Estudio:",
    "displays":[
      {
        "title":"Mapas interactivos Pokémon",
        "year":2020,
        "ribbons":[
          "HTML5", "CSS3", "JS", "Node.js", "Bootstrap", "SQL", "Vue.js"
        ],
        "contents":[
          {
            "textWidth":"60%",
            "contentWidth":"40%",
            "text":[
              "Una simple aplicación web, pequeña, limpia, rápida e intuitiva, se comunica con una <b>Base de datos open source externa</b> para encontrar la data, la cual es recibida, procesada y presentada en una página hermosamente diseñada.",
              "La aplicación es <b>responsiva</b>, adaptándose automáticamente a pantallas de cualquier tamaño, resolucion y dispositivo, funcionando en dispositivos mobiles tanto en landscape cómo en portrait, tambien es <b>reactiva</b> mediante la utilizacion de él framework <b>Vue JS</b>.",
              "La página está diseñada para ser eficiente y fácil de cachear, una vez cargada todos los datos necesarios son descargados en una única request a la API, esto permite que las búsquedas del usuario sean respondidas inmediatamente, minimiza la comunicación con la base de datos y permite el uso de la página offline una vez se haya cacheado en el navegador del usuario.",
              "<a href='/Pokemon/Kanto'>Visitalo aquí.</a>"
            ],
            "hContents":1
          }
        ]
      },
      {
        "title":"NARNES",
        "year":2019,
        "ribbons":[
          "C++", "C#"
        ],
        "contents":[
          {
            "textWidth":"50%",
            "contentWidth":"50%",
            "text":[
              "En emulador completo de NES con un giro.",
              "Construido con un <b>núcleo en C++</b> que emula el hardware de la NES a bajo nivel y una <b>GUI de forms con C#</b> intercomunicarse mediante un <b>middleware Interop</b>, tiene todas las características que se esperan de un emulador moderno tales cómo sRAM, save states, grabación de demos e incluso rebobinado.",
              "Más importantemente le permite al usuario crear y cargar <b>’asset packs’</b> que permiten él <b>reemplazo de assets</b> con alternativas definidas por el usuario <b>en tiempo real</b> permitiendo ignorar las restricciones del hardware de NES tales cómo resolución, paleta de colores y fidelidad."
            ],
            "hContents":3
          },
          {
            "textWidth":"40%",
            "contentWidth":"60%",
            "text":[
              "Asistido por una interfaz user friendly, drag-and-drop que permite la creación de ‘asset packs’ sin la necesidad de entender las internas del hardware de NES.",
              "Estos asset packs son guardados en un único archivo <b>.narp</b> que puede ser compartido y utilizado por cualquier persona con NARNES."
            ],
            "hContents":4
          }
        ]
      },
      {
        "title":"NARL",
        "year":2018,
        "ribbons":[
          "C#", "Godot"
        ],
        "contents":[
          {
            "textWidth":"60%",
            "contentWidth":"40%",
            "text":[
              "Un frontend para gaming lightweight pero potente.",
              "Se comunica con múltiples <b>APIs</b> externas para ayudar al usuario a encontrar y descargar banners, screenshots, iconos y covers para sus juegos, también provee un ejecutable separado para navegar los juegos instalados en la PC del usuario, con una <b>GUI</b> limpia que puede ser utilizada tanto con teclado cómo con controles y periféricos."
            ],
            "hContents":5
          },
          {
            "textWidth":"60%",
            "contentWidth":"40%",
            "text":[
              "Le permite al usuario buscar y ejecutar cualquier juego de su PC desde una sola app, también incluye utilidades convenientes tales cómo calcular el tiempo de juego en cada título.",
              "Publicado el primero de enero de 2019, fue mantenido por un año y utilizado por más gente de la que yo hubiese imaginado. Ha sido discontinuado.",
              "<a href='https://simplyb.itch.io/narl'>Encuentralo aquí.</a>"
            ],
            "hContents":6
          }
        ]
      }
    ]
  }
}